# description.py

def description_text(method):
    if method == 'SHA-1':
        description = "SHA-1: — це алгоритм хешування, що створений для генерації унікального фіксованого хеш-значення для будь-якого введеного повідомлення. Однак він застарів і вважається вразливим до колізій, тобто ситуацій, коли два різних вхідних повідомлення можуть виробити однаковий хеш-вихід, що підірвує його використання для безпеки."
        return description
    elif method == 'SHA-224':
        description = "SHA-224: є варіантом алгоритму SHA-2, який генерує 224-бітне хеш-значення. Він використовує ті ж базові принципи, що і SHA-256, але створює коротше хеш-значення."
        return description
    elif method == 'SHA-256':
        description = "SHA-256: є одним з варіантів алгоритму SHA-2 і генерує 256-бітне хеш-значення. Він широко використовується для захисту даних, оскільки відомо, що він є криптографічно стійким."
        return description
    elif method == 'SHA-384':
        description = "SHA-384: є іншим варіантом алгоритму SHA-2 і створює 384-бітне хеш-значення. Він пропонує більшу довжину хеша, ніж SHA-256, що може забезпечити додатковий рівень безпеки в деяких випадках."
        return description
    elif method == 'SHA-512':
        description = "SHA-512: є останнім варіантом алгоритму SHA-2 і генерує 512-бітне хеш-значення. Він також забезпечує високий рівень безпеки і використовується у широкому спектрі криптографічних застосувань."
        return description
    elif method == 'MD5':
        description = "MD5: Message Digest Algorithm 5 (MD5) — це інший алгоритм хешування, який генерує фіксовану довжину хеш-значення (128 біт). Він був широко використовуваний у минулому, але зараз вважається слабким і не рекомендується для захисту даних через його вразливості до колізій і можливість підробки."
        return description

    elif method == 'Fernet':
        description = "Fernet - це сучасний шифр, що використовує симетричне шифрування для захисту даних. Він базується на алгоритмі AES і використовує ключі на основі паролів для шифрування і розшифрування інформації. Fernet забезпечує надійний рівень захисту та використовується для збереження конфіденційних даних у програмах та мережевих додатках."
        return description

    elif method == 'Caesar (Latin)':
        description = "Шифр Цезаря - це вид шифрування, в якому кожна літера тексту замінюється на літеру, розташовану на певну кількість позицій від неї у латинському алфавіті. Зазвичай використовується зсув на кілька позицій вправо чи вліво. Цей метод шифрування є досить простим та використовується для невеликих обсягів тексту, але вразливий до атак brute-force."
        return description
    elif method == 'Caesar (Cyrillic ukr)':
        description = "Шифр Цезаря - це вид шифрування, в якому кожна літера тексту замінюється на літеру, розташовану на певну кількість позицій від неї у латинському алфавіті. Зазвичай використовується зсув на кілька позицій вправо чи вліво. Цей метод шифрування є досить простим та використовується для невеликих обсягів тексту, але вразливий до атак brute-force."
        return description
    elif method == 'Caesar (Cyrillic rus)':
        description = "Шифр Цезаря - це вид шифрування, в якому кожна літера тексту замінюється на літеру, розташовану на певну кількість позицій від неї у латинському алфавіті. Зазвичай використовується зсув на кілька позицій вправо чи вліво. Цей метод шифрування є досить простим та використовується для невеликих обсягів тексту, але вразливий до атак brute-force."
        return description

    elif method == 'Morse Code (Latin)':
        description = "Шифр Морзе - це метод шифрування, де кожна літера або символ тексту кодується послідовністю коротких (крапка) та довгих (тире) сигналів. Кожен символ представляється у вигляді унікальної комбінації крапок та тире, що розшифровуються з допомогою таблиці або алгоритму. Цей шифр використовується для передачі інформації за допомогою світлових, звукових або радіосигналів."
        return description
    elif method == 'Binary':
        description = "Шифр Бінарний - це система шифрування, в якій кожен символ або літера тексту представляється у вигляді послідовності нулів та одиниць. Кожна буква або символ має свій унікальний двійковий код. Цей метод широко використовується у комп'ютерних системах та мережах для збереження та передачі даних."
        return description
    elif method == 'Base64':
        description = "Base64 - це метод кодування, який використовується для представлення бінарних даних у текстовому форматі. Кожен блок даних конвертується у послідовність символів ASCII, що складаються з 64 можливих символів (латинські літери верхнього та нижнього регістрів, цифри та спеціальні символи). Base64 широко використовується у веб-розробці та електронній пошті для передачі даних через інтернет."
        return description
    elif method == 'Hexadecimal (Latin)':
        description = "Шістнадцяткова система - це система числення, в якій використовуються 16 символів: цифри від 0 до 9 та літери від A до F. Кожне число або символ кодується у вигляді комбінації цифр та/або літер. Шістнадцяткова система широко використовується у комп'ютерній науці для представлення чисел та даних."
        return description
    elif method == 'Octal':
        description = "Вісімкова система - це система числення, в якій використовуються 8 символів: цифри від 0 до 7. Кожне число кодується у вигляді комбінації цифр. Вісімкова система використовується у комп'ютерних науках, але рідше за інші системи (наприклад, десяткова, бінарна або шістнадцяткова)."
        return description
    elif method == 'Decimal':
        description = "Десяткова система - це система числення, в якій використовується 10 символів: цифри від 0 до 9. Кожне число кодується у вигляді комбінації цифр. Десяткова система є найпоширенішою системою числення та використовується в повсякденному житті для представлення чисел."
        return description
    elif method == 'Homomorphism (Cyrillic rus)':
        description = "Гомоморфізм - це метод шифрування, в якому кожен символ тексту або блок тексту замінюється на інший символ чи блок символів відповідно до певного правила або таблиці відповідності. Цей метод може використовувати кириличні символи для шифрування і розшифрування інформації."
        return description
    elif method == 'Enigma (Latin)':
        description = "Машина Енігма - це електромеханічний шифратор, який використовувався на початку 20 століття для шифрування та дешифрування секретної інформації. Енігма використовувала механічні деталі для перетворення вхідного тексту у шифрований вихідний текст за допомогою роторів та електричних контактів. Цей шифр став відомим у зв'язку з використанням його нацистсь"
        return description
    elif method == '123':
        description = None
        return description
    else:
        return "Метод шифрування не підтримується або відсутній ключ"
