ukrainian_alphabet_upper = ['А', 'Б', 'В', 'Г', 'Ґ', 'Д', 'Е', 'Є', 'Ж', 'З', 'И', 'І', 'Ї', 'Й', 'К', 'Л', 'М', 'Н',
                            'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ю', 'Я']
ukrainian_alphabet_lower = ['а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н',
                            'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ю', 'я']
n1 = 33
russian_alphabet_upper = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У',
                          'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'ь', 'Ы', 'Э', 'Ю', 'Я']
russian_alphabet_lower = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у',
                          'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ы', 'э', 'ю', 'я']
n2 = 30
english_alphabet_upper = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S',
                          'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
english_alphabet_lower = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's',
                          't', 'u', 'v', 'w', 'x', 'y', 'z']
n3 = 26


morse_code_dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
                   'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
                   'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
                   'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
                   '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', '.': '.-.-.-', ',': '--..--',
                   '?': '..--..', "'": '.----.', '!': '-.-.--', '/': '-..-.', '(': '-.--.', ')': '-.--.-', '&': '.-...',
                   ':': '---...', ';': '-.-.-.', '=': '-...-', '+': '.-.-.', '-': '-....-', '_': '..--.-',
                   '"': '.-..-.', '$': '...-..-', '@': '.--.-.'}

Homomorphism_alphabet = {
    'А': ['00', '33', '65', '86', '90', '70'],
    'Б': ['01', '34'],
    'В': ['02', '35', '66'],
    'Г': ['03', '36'],
    'Д': ['04', '37'],
    'Е': ['05', '38', '67', '87', '91', '99', '42'],
    'Ж': ['06', '39'],
    'З': ['07', '40'],
    'И': ['08', '41', '69', '88', '92', '32'],
    'К': ['09', '43', '71'],
    'Л': ['10', '44', '72'],
    'М': ['11', '45', '73'],
    'Н': ['12', '46', '74', '97'],
    'О': ['13', '47', '75', '89', '93', '98'],
    'П': ['14', '48'],
    'Р': ['15', '49', '68', '94'],
    'С': ['16', '50', '53', '77', '95'],
    'Т': ['17', '51', '78', '96'],
    'У': ['18', '52', '79'],
    'Ф': ['19'],
    'Х': ['20', '54', '80'],
    'Ц': ['21', '55'],
    'Ч': ['22', '56'],
    'Ш': ['23', '57'],
    'Щ': ['24', '58'],
    'Ь': ['25', '59'],
    'Ы': ['26', '60', '81'],
    'Э': ['27', '62', '83', '61'],
    'Ю': ['28', '63', '84'],
    'Я': ['29', '64', '85', '82']
}

# 'Trisemus Latin', 'Trisemus Cyrillic (ukr)', 'Trisemus Cyrillic (rus)',
Trisemus_rus = [
    'Р', 'Е', 'С', 'П', 'У',
    'Б', 'Л', 'И', 'К', 'А',
    'В', 'Г', 'Д', 'Ж', 'З',
    'М', 'Н', 'О', 'Т', 'Ф',
    'Х', 'Ц', 'Ч', 'Ш', 'Щ',
    'Ь', 'Ы', 'Э', 'Ю', 'Я'
]
"КЛИМЕНКО АРИСТАРХ"
"ЖГДХЛЦЖЧ ЗБДИШЗБЬ"



ciphertext = "АНБЧФ ЕБЛЗГ ДФЗЫД УЖЧШЧ БЕЬКБ ДМЧОУ ШЖКЧШ ЛБЛДЦ ЩЧБХЗ ЫДЛДЛ ЛИМЧД ИШМИЧ ЧШМЛШ ИШМЛЦ ЦЧЦЗФ ЕМЗПШ ИУАНБ ЧФЗХД ЖЧЦЩД ОЛЦЫД ЗГРЦЧ ИШДЫЛ ГЧИШЦ ЧИШДД ОЧИША КЦЧИШ Д"
k =          "УГРОЗ ЫРЕАЛ ИЗАЦИ ЯКОТО РЫХПР ИВОДЯ ткпот ЕРЕИН ФОРМА ЦИЕИЕ ЕСВОИ СТВСО ОТВЕТ СТВЕН НОНАЗ ЫВАЮТ СЯУГР ОЗАМИ КОНФИ ДЕНЦИ АЛЬНО СТИЦЕ ЛОСТН ОСТИИ ДОСТУ ПНОСТ И"
M =          "УГРОЗЫ РЕАЛИЗАЦИЯ КОТОРЫХ ПРИВОДЯТ к ПОТЕРЕ ИНФОРМАЦИЕ И ЕЕ СВОИСТВСО ОТВЕТСТВЕННО ПОЗЫВАЮТСЯ УГРОЗАМИ КОНФИДЕНЦИАЛЬНОСТИ ЦЕЛОСТНОСТИИ ДОСТУПНОС И"

alphabet = "АБВГДЕЖЗИКЛМНОПРСТУФХЦЧШЩЬЫЭЮЯ"
m = "РЕСПУБЛИКАВГДЖЗМНОТФХЦЧШЩЬЫЭЮЯ"
rr = {'Р': '0', 'Е': '1', 'С': '2', 'П': '3', 'У': '4', 'Б': '5', 'Л': '6', 'И': '7', 'К': '8', 'А': '9',
            'В': '10', 'Г': '11', 'Д': '12', 'Ж': '13', 'З': '14', 'М': '15', 'Н': '16', 'О': '17', 'Т': '18',
            'Ф': '19', 'Х': '20', 'Ц': '21', 'Ч': '22', 'Ш': '23', 'Щ': '24', 'Ь': '25', 'Ы': '26', 'Э': '27',
            'Ю': '28', 'Я': '29'}
